#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Apply 🚀`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/chrisnieves60/learn-terraform-github-actions2/runs/run-vXooPWMLqUSyNEdY

Waiting for the plan to start...

Terraform v1.9.1
on linux_amd64
Initializing plugins and modules...
aws_api_gateway_rest_api.InsertApi: Refreshing state... [id=w9gw8qgulf]
aws_iam_role.ssm_role: Refreshing state... [id=ssm_role]
aws_vpc.my_vpc: Refreshing state... [id=vpc-06b4e93a99deba27f]
aws_iam_role.lambda_exec: Refreshing state... [id=lambda_exec_role]
aws_eip.my_eip: Refreshing state... [id=eipalloc-001f2275da08c2899]
aws_api_gateway_method.post_method: Refreshing state... [id=agm-w9gw8qgulf-xtws4zpdd6-POST]
aws_iam_role_policy_attachment.ssm_role_policy: Refreshing state... [id=ssm_role-20240709220202681600000001]
aws_iam_instance_profile.ssm_instance_profile: Refreshing state... [id=ssm_instance_profile]
aws_iam_role_policy.lambda_policy: Refreshing state... [id=lambda_exec_role:lambda_exec_policy]
aws_lambda_function.InsertionScript: Refreshing state... [id=InsertionScript]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-w9gw8qgulf-xtws4zpdd6-POST]
aws_api_gateway_deployment.InsertionDeployment: Refreshing state... [id=jamtej]
aws_internet_gateway.my_igw: Refreshing state... [id=igw-085ab54a974b4743c]
aws_subnet.my_subnet: Refreshing state... [id=subnet-0f73c88ce583f7dfb]
aws_security_group.my_security_group: Refreshing state... [id=sg-0f9c4b0898ea73551]
aws_route_table.my_route_table: Refreshing state... [id=rtb-05a82d6b9ccd599f9]
aws_instance.openemr_instance: Refreshing state... [id=i-0218c85f3f0662d48]
aws_route_table_association.my_route_association: Refreshing state... [id=rtbassoc-0ee994592123e54ca]
aws_eip_association.eip_assoc: Refreshing state... [id=eipassoc-0f0b5964ee75cc9bf]
aws_lambda_function.InsertionScript: Drift detected (update)
aws_api_gateway_rest_api.InsertApi: Drift detected (update)
aws_api_gateway_method.post_method: Drift detected (update)
aws_instance.openemr_instance: Drift detected (update)
aws_api_gateway_integration.lambda_integration: Drift detected (update)
aws_eip.my_eip: Drift detected (update)
aws_iam_role.lambda_exec: Drift detected (update)
aws_iam_role.ssm_role: Drift detected (update)
aws_iam_instance_profile.ssm_instance_profile: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sqs_queue.terraform_queue will be created
  + resource "aws_sqs_queue" "terraform_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "terraform-example-queue.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Apply</summary>

```

terraform
[0m[33mRunning apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.[0m

Preparing the remote apply...
[0m
[0m[33mTo view this run in a browser, visit:[0m
[0m[33mhttps://app.terraform.io/app/chrisnieves60/learn-terraform-github-actions2/runs/run-GYUtq1F6n59BMKa1[0m
[0m
Waiting for the plan to start...

Terraform v1.9.1
on linux_amd64
Initializing plugins and modules...
[1maws_api_gateway_rest_api.InsertApi: Refreshing state... [id=w9gw8qgulf][0m[0m
[1maws_iam_role.lambda_exec: Refreshing state... [id=lambda_exec_role][0m[0m
[1maws_eip.my_eip: Refreshing state... [id=eipalloc-001f2275da08c2899][0m[0m
[1maws_iam_role.ssm_role: Refreshing state... [id=ssm_role][0m[0m
[1maws_vpc.my_vpc: Refreshing state... [id=vpc-06b4e93a99deba27f][0m[0m
[1maws_api_gateway_method.post_method: Refreshing state... [id=agm-w9gw8qgulf-xtws4zpdd6-POST][0m[0m
[1maws_iam_role_policy_attachment.ssm_role_policy: Refreshing state... [id=ssm_role-20240709220202681600000001][0m[0m
[1maws_iam_instance_profile.ssm_instance_profile: Refreshing state... [id=ssm_instance_profile][0m[0m
[1maws_iam_role_policy.lambda_policy: Refreshing state... [id=lambda_exec_role:lambda_exec_policy][0m[0m
[1maws_lambda_function.InsertionScript: Refreshing state... [id=InsertionScript][0m[0m
[1maws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke][0m[0m
[1maws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-w9gw8qgulf-xtws4zpdd6-POST][0m[0m
[1maws_api_gateway_deployment.InsertionDeployment: Refreshing state... [id=jamtej][0m[0m
[1maws_internet_gateway.my_igw: Refreshing state... [id=igw-085ab54a974b4743c][0m[0m
[1maws_subnet.my_subnet: Refreshing state... [id=subnet-0f73c88ce583f7dfb][0m[0m
[1maws_security_group.my_security_group: Refreshing state... [id=sg-0f9c4b0898ea73551][0m[0m
[1maws_route_table.my_route_table: Refreshing state... [id=rtb-05a82d6b9ccd599f9][0m[0m
[1maws_instance.openemr_instance: Refreshing state... [id=i-0218c85f3f0662d48][0m[0m
[1maws_route_table_association.my_route_association: Refreshing state... [id=rtbassoc-0ee994592123e54ca][0m[0m
[1maws_eip_association.eip_assoc: Refreshing state... [id=eipassoc-0f0b5964ee75cc9bf][0m[0m
[1maws_api_gateway_integration.lambda_integration: Drift detected (update)[0m[0m
[1maws_lambda_function.InsertionScript: Drift detected (update)[0m[0m
[1maws_iam_role.ssm_role: Drift detected (update)[0m[0m
[1maws_eip.my_eip: Drift detected (update)[0m[0m
[1maws_api_gateway_method.post_method: Drift detected (update)[0m[0m
[1maws_iam_role.lambda_exec: Drift detected (update)[0m[0m
[1maws_iam_instance_profile.ssm_instance_profile: Drift detected (update)[0m[0m
[1maws_instance.openemr_instance: Drift detected (update)[0m[0m
[1maws_api_gateway_rest_api.InsertApi: Drift detected (update)[0m[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_sqs_queue.terraform_queue[0m will be created
[0m  [32m+[0m[0m resource "aws_sqs_queue" "terraform_queue" {
      [32m+[0m[0m arn                               = (known after apply)
      [32m+[0m[0m content_based_deduplication       = true
      [32m+[0m[0m deduplication_scope               = (known after apply)
      [32m+[0m[0m delay_seconds                     = 0
      [32m+[0m[0m fifo_queue                        = true
      [32m+[0m[0m fifo_throughput_limit             = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m kms_data_key_reuse_period_seconds = (known after apply)
      [32m+[0m[0m max_message_size                  = 262144
      [32m+[0m[0m message_retention_seconds         = 345600
      [32m+[0m[0m name                              = "terraform-example-queue.fifo"
      [32m+[0m[0m name_prefix                       = (known after apply)
      [32m+[0m[0m policy                            = (known after apply)
      [32m+[0m[0m receive_wait_time_seconds         = 0
      [32m+[0m[0m redrive_allow_policy              = (known after apply)
      [32m+[0m[0m redrive_policy                    = (known after apply)
      [32m+[0m[0m sqs_managed_sse_enabled           = (known after apply)
      [32m+[0m[0m tags_all                          = (known after apply)
      [32m+[0m[0m url                               = (known after apply)
      [32m+[0m[0m visibility_timeout_seconds        = 30
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
[1maws_sqs_queue.terraform_queue: Creating...[0m[0m
aws_sqs_queue.terraform_queue: Still creating... [10s elapsed]
aws_sqs_queue.terraform_queue: Still creating... [20s elapsed]
[1maws_sqs_queue.terraform_queue: Creation complete after 26s [id=https://sqs.us-west-2.amazonaws.com/851725414875/terraform-example-queue.fifo][0m[0m

[1m[32mApply complete! Resources: 1 added, 0 changed, 0 destroyed.[0m[0m


```

</details>

*Pushed by: @cnieves-sorenson, Action: `pull_request`*